[
  {
    "id": 1,
    "title": "Kasa - Application Immobilière avec React",
    "slug": "project-kasa",
    "titleModal": "KASA - Application Immobilière avec React",
    "description": "Kasa est une application web de location immobilière entre particuliers, développée avec React, permettant de consulter des logements et leurs informations détaillées (photos, description, équipements...).",
    "projectSheet": {
      "context": "Kasa est une application web de location immobilière développée dans le cadre du Projet 5 de la formation Développeur Web OpenClassrooms, avec pour enjeu principal la prise en main de React et du routing côté client.",
      "objectives": "D'après une maquette figma fournie, l'objectif était de créer une application responsive et dynamique permettant la consultation de logements, tout en respectant une architecture React moderne et des contraintes fonctionnelles précises (navigation, gestion des erreurs, composants réutilisables).",
      "stack": "Le projet a été réalisé avec React, React Router DOM, Vite, et Sass, en utilisant des données simulées au format JSON et une organisation modulaire des composants.",
      "skills": "Ce projet m'a permis de renforcer ma compréhension des composants React, des hooks (useState, useEffect, useParams), de la gestion du routing et de la structuration d'une application front-end maintenable.",
      "results": "L'application est entièrement fonctionnelle, responsive et conforme aux spécifications, avec une navigation fluide, une page 404 gérée et un déploiement en ligne via Netlify.",
      "improvements": "Des évolutions possibles incluent la connexion à une API réelle, l'ajout de tests automatisés, l'amélioration des performances et l'optimisation de l'accessibilité."
    },
    "image": "/projects/screenshot_HomePage_kasa.webp",
    "altImage": "Screenshot de la page d'accueil de Kasa",
    "imageModal": "/projects/kasa_mockup_desktop.webp",
    "altImageModal": "Mockup de la page d'accueil de Kasa",
    "technologies": [
      "HTML/CSS",
      "JavaScript",
      "React",
      "Sass"
    ],
    "githubUrl": "https://github.com/ProjetsDevFanny/Projet5_OCR_Kasa_REACT",
    "liveUrl": "https://projet-kasa-fanny.netlify.app/",
    "featured": false
  },
  {
    "id": 2,
    "title": "Mon Vieux Grimoire - Application de Gestion de Livres avec Backend",
    "slug": "project-mon-vieux-grimoire",
    "titleModal": "Mon Vieux Grimoire - Application de Gestion de Livres avec Backend",
    "description": "Backend complet d'une API REST pour une application de gestion de livres avec système de notation. Le développement a été entièrement réalisé en backend, mettant en œuvre une architecture moderne et sécurisée.",
    "projectSheet": {
      "context": "Mon Vieux Grimoire est une API REST développée dans le cadre de la formation Développeur Web OpenClassrooms, avec pour objectif de concevoir un backend complet, sécurisé et conforme aux bonnes pratiques professionnelles.",
      "objectives": "Le projet visait à créer une API permettant l’authentification des utilisateurs, la gestion CRUD de livres, l’upload et l’optimisation d’images, ainsi qu’un système de notation avec règles métier strictes.",
      "stack": "L’API a été développée avec Node.js, Express, MongoDB et Mongoose, en intégrant des outils de sécurité et de performance comme JWT, bcrypt, Helmet, express-rate-limit, Multer et Sharp.",
      "skills": "Ce projet m’a permis de renforcer mes compétences en architecture MVC, sécurisation d’API, gestion de base de données NoSQL, création de middlewares personnalisés et implémentation de logique métier complexe.",
      "results": "L’API est entièrement fonctionnelle, testée avec Postman, sécurisée contre les principales vulnérabilités et capable de gérer efficacement les fichiers images et les règles d’autorisation utilisateur.",
      "improvements": "Des évolutions possibles incluent l’ajout de tests automatisés, la mise en place d’une documentation Swagger/OpenAPI et l’optimisation du cache et des performances à grande échelle."
    },
    "image": "/projects/vieux_grimoire.webp",
    "altImage": "Screenshot de la page d'accueil de Mon Vieux Grimoire",
    "imageModal": "/projects/vieux_grimoire_mockup_desktop.webp",
    "altImageModal": "Mockup de la page d'accueil de Mon Vieux Grimoire",
    "technologies": [
      "Node.js",
      "Express",
      "MongoDB"
    ],
    "githubUrl": "https://github.com/ProjetsDevFanny/Projet6_OCR_Mon_vieux_grimoire_Backend",
    "liveUrl": "https://mon-vieux-grimoire-ocr-fs.netlify.app/",
    "featured": true
  },
  {
    "id": 3,
    "title": "Carducci - Optimisation de Site Vitrine d'une Photographe",
    "slug": "project-carducci",
    "titleModal": "Carducci - Optimisation de Site Vitrine d'une Photographe",
    "description": "Optimisation complète d'un site vitrine existant pour une photographe : corrections de bugs, amélioration des performances (98% de réduction du poids des images), accessibilité renforcée et SEO optimisé.",
    "projectSheet": {
      "context": "Ce projet, réalisé dans le cadre du Projet 4 de la formation Développeur Web OpenClassrooms, consistait à optimiser un site vitrine existant pour une photographe professionnelle.",
      "objectives": "L’objectif était d’améliorer significativement les performances, l’accessibilité (WCAG) et le référencement SEO, tout en corrigeant des bugs fonctionnels identifiés via les outils de diagnostic.",
      "stack": "Le projet a été réalisé avec Lighthouse, SEO, Wave, Accessibilité, et des outils de compression d'images.",
      "skills": "Ce projet m’a permis de maîtriser l’analyse de performance, l’optimisation des images (WebP, responsive), l’amélioration de l’accessibilité, la structuration sémantique HTML et les bonnes pratiques SEO.",
      "results": "Les scores Lighthouse ont atteint 99 % en performance et 100 % en accessibilité et SEO, avec une réduction du poids des images de 98,5 %, améliorant fortement le temps de chargement et l’expérience utilisateur.",
      "improvements": "Des évolutions possibles incluent l’automatisation des audits de performance, l’ajout de tests d’accessibilité avancés et une migration vers un framework moderne si le projet évoluait."
    },
    "image": "/projects/screenshot_carducci_desktop.webp",
    "altImage": "Screenshot de la page d'accueil de Carducci",
    "imageModal": "/projects/carducci_mockup_desktop.webp",
    "altImageModal": "Mockup de la page d'accueil de Carducci",
    "technologies": [
      "Lighthouse",
      "SEO",
      "Wave",
      "Accessibilité"
    ],
    "githubUrl": "https://github.com/ProjetsDevFanny/Projet4_OCR_Debuggez-et-optimisez-un-site-de-photographe",
    "liveUrl": "https://ninacarducci-photographe-bordeaux.netlify.app",
    "featured": false
  },
  {
    "id": 4,
    "title": "Floppy_Bird — Jeu 2D en JavaScript Vanilla (Canvas)",
    "slug": "project-floppy-bird",
    "titleModal": "Floppy_Bird — Jeu 2D en JavaScript Vanilla (Canvas)",
    "description": "Jeu vidéo 2D inspiré de Flappy Bird : faire voler l’oiseau sans tomber ni toucher les tuyaux. Développé de A à Z en JavaScript vanilla avec rendu Canvas, sprites animés, collisions, score et persistance locale.",
    "projectSheet": {
      "context": "Bienvenue dans ma version personnalisée de Flappy Bird, développée dans le cadre du TP11 (Formation autodidacte FromScratch) : un jeu 2D construit sans framework pour travailler la logique temps réel et le rendu sur canvas.",
      "objectives": "Approfondir JavaScript natif (boucle de jeu, requestAnimationFrame) et le rendu Canvas : animations de sprites, génération aléatoire des tuyaux, gestion des événements clavier/souris, collisions et score.",
      "stack": "HTML5 + CSS3, JavaScript Vanilla (sans librairie), Canvas 2D, gestion d’assets audio/visuels en local et localStorage pour persister le meilleur score.",
      "skills": "Animation via requestAnimationFrame, structuration d’une boucle de jeu, gestion des ressources (sprites/sons), détection de collisions (hitboxes) et recyclage d’objets (tuyaux) pour un gameplay infini.",
      "results": "Gameplay fluide (clavier/souris), animations par sprites (oiseau + fond défilant), collisions précises, score + meilleur score sauvegardé et ambiance sonore (musique + effets).",
      "improvements": "Ajouter une difficulté progressive (vitesse / gap), implémenter une pause, ajouter un écran Game Over avec replay, et rendre le jeu plus responsive mobile."
    },
    "image": "/projects/screenshot_floppy_bird.webp",
    "altImage": "Aperçu illustré du projet Floppy Bird",
    "imageModal": "/projects/mockup_floppy_bird.webp",
    "altImageModal": "Aperçu illustré du projet Floppy Bird",
    "technologies": [
      "HTML",
      "CSS",
      "JavaScript",
      "Canvas"
    ],
    "githubUrl": "https://github.com/ProjetsDevFanny/TP11_FromScratch_Floppy_Bird_Canvas_JS",
    "liveUrl": "https://projetsdevfanny.github.io/TP11_FromScratch_Floppy_Bird_Canvas_JS/",
    "featured": false
  },
  {
    "id": 5,
    "title": "Sophie_Bluel — Portfolio Architecte (Front Vanilla JS)",
    "slug": "project-sophie-bluel",
    "titleModal": "Sophie_Bluel — Portfolio Architecte (Vanilla JS)",
    "description": "Portfolio d'architecte d'intérieur interactif proposant une galerie filtrable, modales de visualisation et un mode édition sécurisé pour gérer les œuvres. Frontend en JavaScript vanilla consommant une API Node.js/Express pour l'administration et l'upload d'images.",
    "projectSheet": {
      "context": "Projet 3 de la formation Développeur Web (OpenClassrooms) : Coder le front-end d'un portfolio d'architecte d'intérieur en vanilla JS, en respectant une architecture modulaire, d'après une maquette figma fournie. Le backend a déjà été codé.",
      "objectives": "Construire une galerie dynamique avec filtres, modales accessibles, authentification pour le mode édition, et fonctionnalités d'ajout/suppression d'œuvres via une API REST. Travailler la communication front↔back et la gestion d'assets.",
      "stack": "HTML5, CSS3, JavaScript (ES6 modules), Fetch API.",
      "skills": "DOM dynamique, modularisation JS, fetch, gestion de modales accessibles, upload d'images, gestion d'état centralisée (projectsArray).",
      "results": "Galerie fonctionnelle avec filtres par catégorie, modales pour afficher et ajouter des projets, authentification admin (compte test), upload d'images et suppression de projets depuis l'interface d'édition.",
      "improvements": "Rendre l'interface plus responsive, optimiser les images (lazy/load/ compression), ajouter pagination ou infinite scroll, renforcer la sécurité des tokens et ajouter tests automatisés."
    },
    "image": "/projects/screenshot_desktop.webp",
    "altImage": "Capture d'écran desktop du portfolio Sophie Bluel",
    "imageModal": "/projects/sophie_bluel_mockup.webp",
    "altImageModal": "Photo de présentation du projet Sophie Bluel",
    "technologies": [
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "githubUrl": "https://github.com/ProjetsDevFanny/Projet3_OCR_Sophie_Bluel_JS_Vanilla",
    "liveUrl": "",
    "featured": false
  },
  {
  "id": 6,
  "title": "Cine-App — Application Films (React + TMDB)",
  "slug": "project-cine-app-react",
  "titleModal": "Cine-App — Application de recherche de films (React)",
  "description": "Application web de recherche de films permettant d'explorer les tendances, trier par popularité et sauvegarder ses films favoris. Développée en React avec intégration de l’API The Movie Database (TMDB) et persistance locale des données.",
  "projectSheet": {
    "context": "Projet de formation React visant à consolider les bases du développement front-end moderne : composants réutilisables, gestion d'état avec Hooks, intégration d'une API REST et mise en place d'une navigation entre pages.",
    "objectives": "Créer une application permettant la recherche en temps réel de films, le tri par popularité (top/flop), l'affichage des genres et la gestion d'un système de favoris persistants grâce au localStorage.",
    "stack": "React.js, Axios, SASS, CSS3, React Router DOM, TMDB API.",
    "skills": "Hooks React (useState, useEffect), gestion d'état, appels API avec Axios, routing avec react-router-dom, persistance avec localStorage, tri et filtrage de données, composants réutilisables.",
    "results": "Application fonctionnelle avec recherche dynamique, tri des films par popularité, affichage des genres, système de favoris sauvegardé localement et interface responsive adaptée mobile et desktop.",
    "improvements": "Ajouter une pagination ou infinite scroll, implémenter un système de gestion d'erreurs plus avancé, optimiser les performances (memoization), ajouter des tests unitaires et améliorer l'accessibilité (ARIA)."
  },
  "image": "/projects/screenshot_cine_app.webp",
  "altImage": "Capture d'écran desktop de l'application Cine-App",
  "imageModal": "/projects/screenshot_cine_app_mockup.webp",
  "altImageModal": "Mockup de présentation du projet Cine-App",
  "technologies": [
    "React",
    "SASS",
    "Axios",
    "React Router",
    "TMDB API"
  ],
  "githubUrl": "https://github.com/ProjetsDevFanny/FormationFS-REACT-TP2-Cine-app",
  "liveUrl": "https://cine-app-react-fanny.netlify.app/",
  "featured": false
}
]