[
  {
    "id": 1,
    "title": "Application React",
    "description": "Kasa est une application web de location immobilière entre particuliers, développée avec React, permettant de consulter des logements et leurs informations détaillées (photos, description, équipements...).",
    "detailedDescription": "Kasa est une application web de location immobilière entre particuliers développée avec React. Ce projet m'a permis de maîtriser les concepts fondamentaux de React : composants, props, état, hooks (useState, useEffect), et la gestion de la navigation avec React Router. J'ai également utilisé Sass pour le styling avec une architecture BEM, créant une interface moderne et responsive. L'application permet de consulter une liste de logements, de voir les détails de chaque logement avec un carrousel d'images, et de gérer les erreurs 404. Le code est structuré de manière modulaire avec des composants réutilisables.",
    "image": "/src/assets/images/projects/screenshot_HomePage_kasa.png",
    "technologies": ["HTML/CSS", "JavaScript", "React", "Sass"],
    "githubUrl": "https://github.com/ProjetsDevFanny/Projet5_OCR_Kasa_REACT",
    "liveUrl": "https://projet-kasa-fanny.netlify.app/",
    "featured": false
  },
  {
    "id": 2,
    "title": "Application Backend",
    "description": "Backend complet d'une API REST pour une application de gestion de livres avec système de notation. Le développement a été entièrement réalisé en backend, mettant en œuvre une architecture moderne et sécurisée.",
    "detailedDescription": "Mon Vieux Grimoire est une API REST complète développée avec Node.js et Express pour une application de gestion de livres. Ce projet m'a permis de maîtriser le développement backend : création d'API RESTful, gestion de base de données MongoDB avec Mongoose, authentification JWT, sécurisation des routes, gestion des fichiers (multer), et validation des données. J'ai implémenté un système de notation des livres, de gestion des utilisateurs avec différents rôles, et de gestion des images. L'API est documentée et suit les bonnes pratiques de sécurité (helmet, rate limiting, validation des entrées).",
    "image": "/src/assets/images/projects/vieux_grimoire.png",
    "technologies": ["Node.js", "Express", "MongoDB"],
    "githubUrl": "https://github.com/ProjetsDevFanny/Projet6_OCR_Mon_vieux_grimoire_Backend",
    "liveUrl": "https://votre-ecommerce.com",
    "featured": false
  },
  {
    "id": 3,
    "title": "Degugging & SEO",
    "description": "Optimisation complète d'un site vitrine existant pour une photographe : corrections de bugs, amélioration des performances (98% de réduction du poids des images), accessibilité renforcée et SEO optimisé.",
    "detailedDescription": "Optimisation complète d'un site vitrine existant pour une photographe. J'ai effectué un audit complet avec Lighthouse, corrigé les bugs JavaScript, optimisé les performances (réduction de 98% du poids des images avec compression et formats modernes), amélioré l'accessibilité (conformité WCAG avec l'outil Wave), et optimisé le SEO (balises meta, sémantique HTML, structure des données). Le site a gagné plusieurs points sur Lighthouse (Performance, Accessibilité, SEO) et est maintenant conforme aux standards web modernes. J'ai également amélioré l'expérience utilisateur avec des animations fluides et une navigation améliorée.",
    "image": "/src/assets/images/projects/screenshot_carducci_desktop.png",
    "technologies": ["Lighthouse", "SEO", "Wave", "Accessibilité"],
    "githubUrl": "https://github.com/ProjetsDevFanny/Projet4_OCR_Debuggez-et-optimisez-un-site-de-photographe",
    "liveUrl": "https://ninacarducci-photographe-bordeaux.netlify.app",
    "featured": false
  }
]